# YOLOv26-GPR-MedSAM, AGPL-3.0 license
# Architecture: YOLOv26 + MedSAM ViT-B Multi-Scale Cross-Attention FPN
# Task: GPR subsurface void detection (civil engineering inspection)
# Input: 9-channel triple GPR (3 scan orientations x 3ch)
#
# vs yolov26_gpr.yaml (DINOv3 version):
#   DINOv3  pretrained on 1.6B natural images  →  large domain gap with GPR
#   MedSAM  pretrained on 1.5M medical images  →  ultrasound ≈ GPR physics
#     - both: pulse-echo wave, hyperbolic diffraction, layered reflections
#     - both: speckle/clutter noise, void = signal dropout
#
# MedSAM checkpoint: wanglab/medsam-vit-base  (HuggingFace)
# ViT-B:  hidden_dim=768, patch16, 12 transformer blocks
# image_size 512: good speed/quality trade-off (MedSAM native = 1024)
#
# Recommended scale for ~2700 images: 's' or 'm'

nc: 1   # Cavity (void)
ch: 9   # 9-channel triple GPR input

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]

  # --- MedSAM Feature Pyramid pre-extractor ---
  # Runs MedSAM ViT-B once on the 9-ch input; hooks P3/P4/P5 ViT features.
  # Passthrough: returns original 9-ch tensor unchanged (c2 = c1).
  # args: [checkpoint, freeze, image_size]
  - [-1, 1, MedSAMFPN, ["wanglab/medsam-vit-base", true, 512]]   # 0  passthrough (c2=9ch)

  # --- CNN stem ---
  - [-1, 1, Conv,  [64, 3, 2]]                                    # 1  P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]                            # 2  P2/4  (dilated)
  - [-1, 2, C3k2,  [256, False, 0.25]]                           # 3

  # --- P3/8 with MedSAM cross-attention ---
  - [-1, 1, Conv,  [256, 3, 2]]                                   # 4  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]                           # 5  CNN P3
  - [-1, 1, MedSAMCrossFusion, ["p3", 4]]                        # 6  MedSAM-guided P3

  # --- P4/16 with MedSAM cross-attention ---
  - [-1, 1, Conv,  [512, 3, 2]]                                   # 7
  - [-1, 4, A2C2f, [512, True, 4]]                               # 8  CNN P4
  - [-1, 1, MedSAMCrossFusion, ["p4", 4]]                        # 9  MedSAM-guided P4

  # --- P5/32 with MedSAM cross-attention ---
  - [-1, 1, Conv,  [1024, 3, 2]]                                  # 10
  - [-1, 4, A2C2f, [1024, True, 1]]                              # 11 CNN P5
  - [-1, 1, MedSAMCrossFusion, ["p5", 8]]                        # 12 MedSAM-guided P5

head:
  # --- Top-down path ---
  - [-1,     1, nn.Upsample,  [None, 2, "nearest"]]               # 13
  - [[-1, 9], 1, Concat,      [1]]   # cat backbone P4            # 14
  - [-1,     2, A2C2f,        [512, False, -1]]                   # 15

  - [-1,     1, nn.Upsample,  [None, 2, "nearest"]]               # 16
  - [[-1, 6], 1, Concat,      [1]]   # cat backbone P3            # 17
  - [-1,     2, A2C2f,        [256, False, -1]]                   # 18  P3 output

  # --- Bottom-up path ---
  - [-1,      1, Conv,        [256, 3, 2]]                        # 19
  - [[-1, 15], 1, Concat,     [1]]   # cat head P4                # 20
  - [-1,      2, A2C2f,       [512, False, -1]]                   # 21  P4 output

  - [-1,      1, Conv,        [512, 3, 2]]                        # 22
  - [[-1, 12], 1, Concat,     [1]]   # cat head P5                # 23
  - [-1,      2, C3k2,        [1024, True]]                       # 24  P5 output

  - [[18, 21, 24], 1, Detect, [nc]]                               # Detect(P3, P4, P5)
