# YOLOv26-GPR, AGPL-3.0 license
# Architecture: YOLOv26 + DINOv3 Multi-Scale Cross-Attention FPN
# Task: GPR subsurface void detection (civil engineering inspection)
# Input: 9-channel triple GPR (3 scan orientations x 3ch)
#
# Key innovations vs YOLOv12-based predecessors:
#   1. DINOv3FPN      - runs DINOv3 once; caches P3/P4/P5 ViT features as passthrough
#   2. DINOv3CrossFusion - CNN(Q) x DINOv3(K,V) cross-attention at every FPN level
#   3. gamma-gated residual (init=0) - stable training on small GPR datasets (~2700 imgs)
#
# Set nc before training:
#   nc: 1  -> void only
#   nc: 3  -> void / rebar / delamination
#
# Recommended scale for ~2700 images: 's' or 'm'

nc: 1   # Cavity (void) - matches data_all.yaml
ch: 9   # 9-channel triple GPR input

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.50, 1.00, 512]

# DINOv3 settings reference (actual params in DINOv3FPN layer below)
dinov3:
  model_name: "facebook/dinov3-vits16-pretrain-lvd1689m"  # ViT-S/16 (dim=384), trained on LVD-1.6B
  freeze: true                                              # keep ViT frozen (recommended for small dataset)
  image_size: 224

backbone:
  # [from, repeats, module, args]

  # --- DINOv3 Feature Pyramid pre-extractor ---
  # Runs ViT once on the 9-ch input; caches features at P3/P4/P5 ViT depths.
  # Passthrough: returns original 9-ch tensor unchanged (c2 = c1).
  - [-1, 1, DINOv3FPN, ["facebook/dinov3-vits16-pretrain-lvd1689m", true, 224]]  # 0  passthrough (c2=9ch)

  # --- CNN stem ---
  - [-1, 1, Conv,  [64, 3, 2]]                                 # 1  P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]                         # 2  P2/4  (dilated)
  - [-1, 2, C3k2,  [256, False, 0.25]]                        # 3

  # --- P3/8 with DINOv3 cross-attention ---
  - [-1, 1, Conv,  [256, 3, 2]]                                # 4  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]                        # 5  CNN P3
  - [-1, 1, DINOv3CrossFusion, ["p3", 4]]                     # 6  DINOv3-guided P3

  # --- P4/16 with DINOv3 cross-attention ---
  - [-1, 1, Conv,  [512, 3, 2]]                                # 7
  - [-1, 4, A2C2f, [512, True, 4]]                            # 8  CNN P4
  - [-1, 1, DINOv3CrossFusion, ["p4", 4]]                     # 9  DINOv3-guided P4

  # --- P5/32 with DINOv3 cross-attention ---
  - [-1, 1, Conv,  [1024, 3, 2]]                               # 10
  - [-1, 4, A2C2f, [1024, True, 1]]                           # 11 CNN P5
  - [-1, 1, DINOv3CrossFusion, ["p5", 8]]                     # 12 DINOv3-guided P5

head:
  # --- Top-down path ---
  - [-1,     1, nn.Upsample,  [None, 2, "nearest"]]            # 13
  - [[-1, 9], 1, Concat,      [1]]   # cat backbone P4         # 14
  - [-1,     2, A2C2f,        [512, False, -1]]                # 15

  - [-1,     1, nn.Upsample,  [None, 2, "nearest"]]            # 16
  - [[-1, 6], 1, Concat,      [1]]   # cat backbone P3         # 17
  - [-1,     2, A2C2f,        [256, False, -1]]                # 18  P3 output

  # --- Bottom-up path ---
  - [-1,      1, Conv,        [256, 3, 2]]                     # 19
  - [[-1, 15], 1, Concat,     [1]]   # cat head P4             # 20
  - [-1,      2, A2C2f,       [512, False, -1]]                # 21  P4 output

  - [-1,      1, Conv,        [512, 3, 2]]                     # 22
  - [[-1, 12], 1, Concat,     [1]]   # cat head P5             # 23
  - [-1,      2, C3k2,        [1024, True]]                    # 24  P5 output

  - [[18, 21, 24], 1, Detect, [nc]]                            # Detect(P3, P4, P5)
